app/controllers/authors/elements_controller.rb

    def create
      @element = @post.elements.build(element_params)

      if @element.save
---
INSERT INTO "elements" ("element_type", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["element_type", "paragraph"], ["post_id", 2], ["created_at", "2021-01-04 01:59:45.380021"], ["updated_at", "2021-01-04 01:59:45.380021"]]

    def update
      @element.update(element_params)
---
UPDATE "elements" SET "content" = ?, "updated_at" = ? WHERE "elements"."id" = ?  [["content", "yo"], ["updated_at", "2021-01-04 01:59:54.400529"], ["id", 1]]

      def set_post
        @post = current_author.posts.find(params[:post_id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."author_id" = ? AND "posts"."id" = ? LIMIT ?  [["author_id", 1], ["id", 2], ["LIMIT", 1]]

      def set_element
        @element = @post.elements.find(params[:id])
---
SELECT "elements".* FROM "elements" WHERE "elements"."post_id" = ? AND "elements"."id" = ? LIMIT ?  [["post_id", 2], ["id", 1], ["LIMIT", 1]]