app/controllers/authors/posts_controller.rb

    def create
      @post = current_author.posts.build(post_params)

      if @post.save
---
INSERT INTO "posts" ("title", "description", "author_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "test3"], ["description", "Hey"], ["author_id", 1], ["created_at", "2021-01-04 02:27:52.755620"], ["updated_at", "2021-01-04 02:27:52.755620"]]

    def update
      if @post.update(post_params)
---
UPDATE "posts" SET "description" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["description", "test number 2\r\njne"], ["updated_at", "2021-01-04 02:00:30.689910"], ["id", 2]]

      def set_post
        @post = current_author.posts.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."author_id" = ? AND "posts"."id" = ? LIMIT ?  [["author_id", 1], ["id", 1], ["LIMIT", 1]]