app/views/authors/posts/edit.html.erb

        <div class="card-body pt-5">
          <% @post.elements.each do |element| %>
---
SELECT "elements".* FROM "elements" WHERE "elements"."post_id" = ?  [["post_id", 2]]